#+title:     Vim to Emacs
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2024-03-18 Mon>
#+language:  en
#+file_tags:
#+tags:      vim emacs
#+auto_id:   t
#+toc:       headlines 3
#+hugo_draft: t

* Emacs Lisp - Why this editor is 40+ years old and still going
:PROPERTIES:
:CUSTOM_ID: emacs-lisp---why-this-editor-is-40-years-old-and-still-going
:END:

I'm going to go on record here:  Every language, even if it's totally different
or has some crazy paradigm shift, should always start with Lisp as its base
syntax, and then _justify_ deviations as necessary due to language features.
You don't like parenthesis?  Eh, they really do go away.  The experience I've
had from learning Lisp is that 90% of the syntax can be learned in about 10
minutes, and I find myself wishing languages did less to celebrate their syntax
and instead embraced Lisp as their foundation.  =car= and =cdr= are entities for
the standard library - things that can vary freely.  But everything being an S
expression right from the get-go is crazy good.

Chances are you've picked up multiple languages if you're on this journey.
Learning Emacs Lisp will help you in ways you never thought.  It gives Emacs
much of its power, because the entire editor is controlled via this language.
You want to insert text automatically?  Lisp.  You want to format your code on
save?  Lisp.  You want to _set a variable to a static value_?  Lisp.

I didn't read books on Lisp or write hello-world in Lisp.  I just dove into
Emacs.  Here's how you set a variable statically:

#+begin_src emacs-lisp :results none :exports code
(setq-default fill-column 80)
#+end_src

This sets "fill" to 80 columns, which means that text automatically flows to 80
columns when that feature is turned on.  You want to set another value?

#+begin_src emacs-lisp :results none :exports code
(setq-default org-default-notes-file "~/notes/notes.org")
#+end_src

Okay something more complex.  Let's do a list.

#+begin_src emacs-lisp :results none :exports code
(setq-default mu4e-personal-addresses '("foo@bar.com" "bar@foo.com"))
#+end_src

Pretty simple, yeah?  Use =setq-default= (a function), pass it a variable
name (=fill-column=), and then a value (=80=).  To call a function in Lisp, you
surround the function and any arguments with parenthesis.  Here's how you add
some numbers:

#+begin_src emacs-lisp :results value :exports both
(+ 1 1)
#+end_src

#+RESULTS:
: 2

Yeah, Lisp isn't big on built in symbols.  So here we can name a function =+=
and it's literally the mathematical plus function.

Lisp stands for LISt Processing.  Everything in Lisp is a... list.  A function
is a list using =defun=, an argument list, and a body.

#+name: add-three-numbers
#+begin_src emacs-lisp :results none :exports code
(defun add-three-numbers (a b c)
  (+ (+ a b) c)
  )
#+end_src

A function application (functional programming term, imperative folks will think
"invocation") is a list whose first element is a function and the remaining
elements are arguments.

#+begin_src emacs-lisp :results value :exports code :noweb yes
<<add-three-numbers>>

(add-three-numbers 1 2 3)
#+end_src

#+RESULTS:
: 6

An =if= is a macro, but basically those are just function calls anyways.  You
have a condition, a positive value, and a negative value.

#+begin_src emacs-lisp :results value :exports code
(if (< 1 3) "foo" "bar")
#+end_src

#+RESULTS:
: foo

So, well, now you know a great deal about Lisp.  The adding syntax might look a
little goofy to you, but myself and many others have come to the conclusion that
this is simple, and you will find that languages that celebrate their syntax
(looking at you, Ruby, and now Rust) tend to paint themselves into a corner.
With Ruby, it is hard for them to go much further with functional programming
bits that other languages are rapidly adopting even if they are imperative at
their core.  This is because they opted to treat arbitrary identifiers as call
sites.  Lisp doesn't really do stuff like that, and there's great power there.

Having rainbow parenthesis is a virtual must in my opinion.  I believe you can
also benefit greatly learning how to =slurp= and =barf= - the language
constructs are so simple that simply moving things in and out of parenthesis is
a powerful editing technique.  I haven't learned how to do this with vim
bindings yet - email me if you do please.

Since Emacs is using a real language to do real things (and not a JSON file or a
script designed just for an editor), you can do real things with it.  Every part
of the editor is part of the editor's API - not just the places the authors
thought you should hook into it.  You can replace or augment functions with
=advice= too, so there's very little you can't control within your grasp.

This is what gives us email, =magit=, agendas, and more.

My ultimate advice with Lisp generally will be that you don't have to learn it
deeply to start doing things with it (which is what Nix feels like), but also
you shouldn't bemoan having to work with it.  I do wish it were statically
typed, so don't think this has my highest praise.  This is my experience with
learning to configure Emacs.

